
## Plan Result




<pre><code>Plan: 11 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.POSTGRES-PASS_V14
  * azurerm_key_vault_secret.POSTGRES-USER_V14
  * azurerm_key_vault_secret.POSTGRES_HOST_V14
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server.pgsql_server
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0]
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config[&#34;backslash_quote&#34;]
  * module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_database.pg_databases[&#34;idamtstsptapi&#34;]
  * module.idam-testing-support-api-db-v14.azurerm_resource_group.rg[0]
  * module.idam-testing-support-api-db-v14.null_resource.set-user-permissions-additionaldbs[&#34;idamtstsptapi&#34;]
  * module.idam-testing-support-api-db-v14.random_password.password
* Update
  * azurerm_key_vault_secret.POSTGRES-PASS[0]
  * azurerm_key_vault_secret.POSTGRES-USER[0]
  * azurerm_key_vault_secret.POSTGRES_HOST[0]
  * module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup
  * module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.POSTGRES-PASS[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-PASS" {
      + content_type            = ""
        id                      = "https://idam-idam-aat.vault.azure.net/secrets/idam-testing-support-api-POSTGRES-PASS/f34b0faebf164649bd7600d285087a91"
        name                    = "idam-testing-support-api-POSTGRES-PASS"
        tags                    = {}
      # Warning: this attribute value will be marked as sensitive and will not
      # display in UI output after applying this change.
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-PASS_V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-PASS_V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat/providers/Microsoft.KeyVault/vaults/idam-idam-aat"
      + name                    = "idam-testing-support-api-POSTGRES-PASS-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES-USER[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES-USER" {
        id                      = "https://idam-idam-aat.vault.azure.net/secrets/idam-testing-support-api-POSTGRES-USER/f700b92654d04b2da9788f628095b5d8"
        name                    = "idam-testing-support-api-POSTGRES-USER"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES-USER_V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES-USER_V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat/providers/Microsoft.KeyVault/vaults/idam-idam-aat"
      + name                    = "idam-testing-support-api-POSTGRES-USER-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST[0] will be updated in-place
  ~ resource "azurerm_key_vault_secret" "POSTGRES_HOST" {
        id                      = "https://idam-idam-aat.vault.azure.net/secrets/idam-testing-support-api-POSTGRES-HOST/4fbb4abb001042cd9895768c15348f89"
        name                    = "idam-testing-support-api-POSTGRES-HOST"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.POSTGRES_HOST_V14 will be created
  + resource "azurerm_key_vault_secret" "POSTGRES_HOST_V14" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-idam-aat/providers/Microsoft.KeyVault/vaults/idam-idam-aat"
      + name                    = "idam-testing-support-api-POSTGRES-HOST-v14"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # module.idam-testing-support-api-db[0].data.azurerm_postgresql_server.replica will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_postgresql_server" "replica" {
      + administrator_login = (known after apply)
      + fqdn                = (known after apply)
      + id                  = (known after apply)
      + identity            = (known after apply)
      + location            = (known after apply)
      + name                = "idam-testing-support-api-idam-aat"
      + resource_group_name = "idam-testing-support-api-data-idam-aat"
      + sku_name            = (known after apply)
      + tags                = (known after apply)
      + version             = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.idam-testing-support-api-db[0].azurerm_resource_group.data-resourcegroup will be updated in-place
  ~ resource "azurerm_resource_group" "data-resourcegroup" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat"
        name     = "idam-testing-support-api-data-idam-aat"
      ~ tags     = {
          ~ "builtFrom"           = "https://github.com/HMCTS/idam-testing-support-api.git" -> "https://github.com/HMCTS/idam-api.git"
          + "expiresAfter"        = "3000-12-31"
            # (6 unchanged elements hidden)
        }
        # (1 unchanged attribute hidden)
    }

  # module.idam-testing-support-api-db[0].azurerm_template_deployment.postgres-paas will be updated in-place
  ~ resource "azurerm_template_deployment" "postgres-paas" {
        id                  = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/idam-testing-support-api-data-idam-aat/providers/Microsoft.Resources/deployments/idam-testing-support-api-idam-aat"
        name                = "idam-testing-support-api-idam-aat"
      ~ parameters          = {
          ~ "commonTags"                 = "eyJhcHBsaWNhdGlvbiI6ImNmdC1pZGFtIiwiYXV0b1NodXRkb3duIjoidHJ1ZSIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9pZGFtLXRlc3Rpbmctc3VwcG9ydC1hcGkuZ2l0IiwiYnVzaW5lc3NBcmVhIjoiQ0ZUIiwiY29udGFjdFNsYWNrQ2hhbm5lbCI6IiNpZGFtLXN1cHBvcnQtY2Z0IiwiZW52aXJvbm1lbnQiOiJzdGFnaW5nIiwibWFuYWdlZEJ5IjoiSWRBTSJ9" -> "eyJhcHBsaWNhdGlvbiI6ImNmdC1pZGFtIiwiYXV0b1NodXRkb3duIjoidHJ1ZSIsImJ1aWx0RnJvbSI6Imh0dHBzOi8vZ2l0aHViLmNvbS9ITUNUUy9pZGFtLWFwaS5naXQiLCJidXNpbmVzc0FyZWEiOiJDRlQiLCJjb250YWN0U2xhY2tDaGFubmVsIjoiI2lkYW0tc3VwcG9ydC1jZnQiLCJlbnZpcm9ubWVudCI6InN0YWdpbmciLCJleHBpcmVzQWZ0ZXIiOiIzMDAwLTEyLTMxIiwibWFuYWdlZEJ5IjoiSWRBTSJ9"
            # (17 unchanged elements hidden)
        }
        # (4 unchanged attributes hidden)
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server.pgsql_server will be created
  + resource "azurerm_postgresql_flexible_server" "pgsql_server" {
      + administrator_login           = "pgadmin"
      + administrator_password        = (sensitive value)
      + backup_retention_days         = 35
      + create_mode                   = "Default"
      + delegated_subnet_id           = "/subscriptions/96c274ce-846d-4e48-89a7-d528432298a7/resourceGroups/cft-aat-network-rg/providers/Microsoft.Network/virtualNetworks/cft-aat-vnet/subnets/postgresql"
      + fqdn                          = (known after apply)
      + geo_redundant_backup_enabled  = false
      + id                            = (known after apply)
      + location                      = "uksouth"
      + name                          = "idam-idam-aat-v14-testing-support-api-idam-aat"
      + private_dns_zone_id           = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/private.postgres.database.azure.com"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + sku_name                      = "GP_Standard_D2s_v3"
      + storage_mb                    = 65536
      + tags                          = {
          + "application"         = "cft-idam"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/idam-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#idam-support-cft"
          + "environment"         = "staging"
          + "expiresAfter"        = "3000-12-31"
          + "managedBy"           = "IdAM"
        }
      + version                       = "14"

      + authentication {
          + active_directory_auth_enabled = true
          + password_auth_enabled         = true
          + tenant_id                     = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
        }

      + maintenance_window {
          + day_of_week  = 0
          + start_hour   = 3
          + start_minute = 0
        }
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "e7ea2042-4ced-45dd-8ae3-e051c6551789"
      + principal_name      = "DTS Platform Operations"
      + principal_type      = "Group"
      + resource_group_name = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + server_name         = "idam-idam-aat-v14-testing-support-api-idam-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_principal_admin[0] will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_principal_admin" {
      + id                  = (known after apply)
      + object_id           = "ca6d5085-485a-417d-8480-c3cefa29df31"
      + principal_name      = "jenkins-cftptl-intsvc-mi"
      + principal_type      = "ServicePrincipal"
      + resource_group_name = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + server_name         = "idam-idam-aat-v14-testing-support-api-idam-aat"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_configuration.pgsql_server_config["backslash_quote"] will be created
  + resource "azurerm_postgresql_flexible_server_configuration" "pgsql_server_config" {
      + id        = (known after apply)
      + name      = "backslash_quote"
      + server_id = (known after apply)
      + value     = "on"
    }

  # module.idam-testing-support-api-db-v14.azurerm_postgresql_flexible_server_database.pg_databases["idamtstsptapi"] will be created
  + resource "azurerm_postgresql_flexible_server_database" "pg_databases" {
      + charset   = "utf8"
      + collation = "en_GB.utf8"
      + id        = (known after apply)
      + name      = "idamtstsptapi"
      + server_id = (known after apply)
    }

  # module.idam-testing-support-api-db-v14.azurerm_resource_group.rg[0] will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "idam-idam-aat-v14-testing-support-api-data-idam-aat"
      + tags     = {
          + "application"         = "cft-idam"
          + "autoShutdown"        = "true"
          + "builtFrom"           = "https://github.com/HMCTS/idam-api.git"
          + "businessArea"        = "CFT"
          + "contactSlackChannel" = "#idam-support-cft"
          + "environment"         = "staging"
          + "expiresAfter"        = "3000-12-31"
          + "managedBy"           = "IdAM"
        }
    }

  # module.idam-testing-support-api-db-v14.null_resource.set-user-permissions-additionaldbs["idamtstsptapi"] will be created
  + resource "null_resource" "set-user-permissions-additionaldbs" {
      + id       = (known after apply)
      + triggers = {
          + "db_reader_user" = "DTS CFT DB Access Reader"
          + "name"           = "idam-idam-aat-v14-testing-support-api"
          + "script_hash"    = "f1b050abe4f2e8fc188c106259b04ba5034688164070e5ebb3e10137ad569f93"
        }
    }

  # module.idam-testing-support-api-db-v14.random_password.password will be created
  + resource "random_password" "password" {
      + bcrypt_hash      = (sensitive value)
      + id               = (known after apply)
      + length           = 20
      + lower            = true
      + min_lower        = 0
      + min_numeric      = 0
      + min_special      = 0
      + min_upper        = 0
      + number           = true
      + numeric          = true
      + override_special = "()-_"
      + result           = (sensitive value)
      + special          = true
      + upper            = true
    }

Plan: 11 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":325,"Program":"tfcmt","SHA1":"","Vars":{}} -->